cases/A_horizontal_unstepped/system/controlDict
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }

application     buoyantPimpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         45;
deltaT          0.002;
writeControl    runTime;
writeInterval   1;
purgeWrite      0;
writeFormat     binary;
writePrecision  7;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;

adjustTimeStep  yes;
maxCo           10;
maxDeltaT       0.1;

functions
{
    outletT
    {
        type surfaceFieldValue; libs ("libfieldFunctionObjects.so");
        writeControl timeStep; writeInterval 500; log true; writeFields false;
        regionType patch; name outlet; operation areaAverage; fields ( T );
    }
    volT
    {
        type volFieldValue; libs ("libfieldFunctionObjects.so");
        writeControl timeStep; writeInterval 500; log true; writeFields false;
        regionType all; operation volAverage; fields ( T );
    }
}
